Stress_test_stats/stress_test_wrk2_c100_t30_R100
Running 30s test @ http://in.archive.ubuntu.com/
  4 threads and 100 connections
  Thread calibration: mean lat.: 3654.894ms, rate sampling interval: 11067ms
  Thread calibration: mean lat.: 3891.586ms, rate sampling interval: 11411ms
  Thread calibration: mean lat.: 3238.582ms, rate sampling interval: 10838ms
  Thread calibration: mean lat.: 3259.594ms, rate sampling interval: 10878ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    74.21ms  314.04ms   6.16s    95.92%
    Req/Sec    27.00      1.00    28.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.18ms
 75.000%   17.04ms
 90.000%   49.12ms
 99.000%    1.19s 
 99.900%    4.28s 
 99.990%    6.16s 
 99.999%    6.16s 
100.000%    6.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.566     0.000000            1         1.00
       2.703     0.100000          209         1.11
       3.463     0.200000          417         1.25
       5.267     0.300000          626         1.43
       8.199     0.400000          835         1.67
      11.175     0.500000         1042         2.00
      12.103     0.550000         1147         2.22
      12.991     0.600000         1251         2.50
      13.999     0.650000         1356         2.86
      15.087     0.700000         1459         3.33
      17.039     0.750000         1563         4.00
      18.095     0.775000         1616         4.44
      19.151     0.800000         1668         5.00
      20.591     0.825000         1720         5.71
      22.799     0.850000         1772         6.67
      36.415     0.875000         1825         8.00
      45.599     0.887500         1850         8.89
      49.119     0.900000         1876        10.00
     105.727     0.912500         1902        11.43
     147.455     0.925000         1928        13.33
     193.663     0.937500         1954        16.00
     205.567     0.943750         1967        17.78
     222.975     0.950000         1980        20.00
     227.967     0.956250         1993        22.86
    1070.079     0.962500         2006        26.67
    1084.415     0.968750         2019        32.00
    1088.511     0.971875         2026        35.56
    1135.615     0.975000         2032        40.00
    1145.855     0.978125         2041        45.71
    1164.287     0.981250         2047        53.33
    1170.431     0.984375         2054        64.00
    1174.527     0.985938         2055        71.11
    1176.575     0.987500         2059        80.00
    1188.863     0.989062         2062        91.43
    1190.911     0.990625         2065       106.67
    1192.959     0.992188         2071       128.00
    1192.959     0.992969         2071       142.22
    1192.959     0.993750         2071       160.00
    1201.151     0.994531         2074       182.86
    1204.223     0.995313         2075       213.33
    1487.871     0.996094         2076       256.00
    2142.207     0.996484         2077       284.44
    2144.255     0.996875         2078       320.00
    2150.399     0.997266         2079       365.71
    2404.351     0.997656         2080       426.67
    2404.351     0.998047         2080       512.00
    3342.335     0.998242         2081       568.89
    3342.335     0.998437         2081       640.00
    4276.223     0.998633         2082       731.43
    4276.223     0.998828         2082       853.33
    4276.223     0.999023         2082      1024.00
    5210.111     0.999121         2083      1137.78
    5210.111     0.999219         2083      1280.00
    5210.111     0.999316         2083      1462.86
    5210.111     0.999414         2083      1706.67
    5210.111     0.999512         2083      2048.00
    6160.383     0.999561         2084      2275.56
    6160.383     1.000000         2084          inf
#[Mean    =       74.210, StdDeviation   =      314.037]
#[Max     =     6156.288, Total count    =         2084]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2955 requests in 30.02s, 2.88MB read
  Socket errors: connect 0, read 0, write 0, timeout 136
Requests/sec:     98.44
Transfer/sec:     98.35KB